doc/http重定向之302报文修改为js方法的方案.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>http重定向之302报文修改为js方法的方案</title>
<!-- 2015-08-26 三 17:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="fangzheng" />
</head>
<body>
<div id="content">
<h1 class="title">http重定向之302报文修改为js方法的方案</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 文档说明</a>
<ul>
<li><a href="#sec-1-1">1.1. 修改记录</a></li>
<li><a href="#sec-1-2">1.2. 编写目的</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 需求分析</a>
<ul>
<li><a href="#sec-2-1">2.1. 业务需求</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 实现方法</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 文档说明</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 修改记录</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">文档版本</th>
<th scope="col" class="right">修订时间</th>
<th scope="col" class="left">修订人</th>
<th scope="col" class="left">修订内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1.0</td>
<td class="right">2015-08-26</td>
<td class="left">方政</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 编写目的</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>了解修改原因及背景
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 需求分析</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 业务需求</h3>
<div class="outline-text-3" id="text-2-1">
<p>
原因：外场摇滚河马页面流失率高，http的302重定向会导致sta访问服务器过于频繁，所以采用javascript方法，由终端浏览器作拦截
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 实现方法</h2>
<div class="outline-text-2" id="text-3">
<p>
报文原始格式如下：
</p>
<div class="org-src-container">

<pre class="src src-http">HTTP/1.1 200 OK\r\n
Content-Type: text/html; charset=UTF-8\r\n
Cache-Control: no-cache\r\n
\r\n
&lt;!DOCTYPE html&gt;
&lt;HTML&gt;&lt;HEAD&gt;&lt;meta http-equiv=\"content-type\" content=\"text/html;charset=gb2312\"&gt;\n
&lt;script type=\"text/javascript\"&gt;\n
function gotourl(){window.top.location.href ='http://10.50.123.52:90?wlanuserip=172.168.1.101&amp;wlanacname=11/11:ee.11.12&amp;wlanacip=10.50.123.52&amp;ssid=fang_haha&amp;nasid=0000000000000460&amp;usermac=34363b7fb17c&amp;wlanapmac=0034cb00b1a7';} gotourl();\n
&lt;/script&gt;\n
&lt;/HEAD&gt;&lt;BODY&gt;ok&lt;/BODY&gt;&lt;/HTML&gt;\r\n
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: fangzheng</p>
<p class="date">Created: 2015-08-26 三 17:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
